### 6.1 텍스트 파일에서 데이터를 읽고 쓰는 법

In [11]:
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
import pandas as pd

In [13]:
df = pd.read_csv('examples/ex1.csv')

In [14]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [17]:
pd.read_csv('examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [18]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [19]:
pd.read_csv('examples/ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
names = ['a','b','c','d','message']

In [21]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [22]:
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [23]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                    index_col=['key1','key2'])

In [24]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [25]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [26]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [27]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [28]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [29]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [31]:
result = pd.read_csv('examples/ex5.csv')

In [32]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

- nan 값이 있는지 확인하기 isnull()

In [33]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [34]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [35]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
sentinels= {'message':['foo','NA'], 'something':['two']}

In [39]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [40]:
pd.options.display.max_rows=10

In [41]:
result = pd.read_csv('examples/ex6.csv')

In [42]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [43]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [44]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [45]:
chunker

In [46]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [47]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

In [48]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [49]:
data = pd.read_csv('examples/ex5.csv')

In [50]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [51]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [52]:
import sys

In [53]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [54]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [55]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [56]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [57]:
dates = pd.date_range('1/1/2000', periods=7)

In [60]:
import numpy as np

In [61]:
ts= pd.Series(np.arange(7), index=dates)

In [64]:
ts.to_csv('examples/tseroes.csv')

C:\Users\danan\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [65]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [66]:
!type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [67]:
import csv
f = open('examples/ex7.csv')

reader = csv.reader(f)

In [68]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [69]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [70]:
header, values = lines[0], lines[1:]

In [71]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [72]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [75]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter=';'
    quotechar='"'
    quoting = csv.QUOTE_MINIMAL
    
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [76]:
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [77]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [78]:
obj = """
{"name":"Wes",
"places_lived": ["United States","Spain","Germany"],
"pet":null,
"siblings":[{"name":"Scott", "age":30, "pets":["Zeus","Zuko"]},
            {"name":"Katie", "age":38,
            "pets":["Sixes","Stache","Cisco"]}]
}
"""

In [79]:
import json

In [80]:
result = json.loads(obj)

In [81]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [82]:
asjson = json.dumps(result)

In [83]:
siblings = pd.DataFrame(result['siblings'], columns=['name','age'])

In [84]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [85]:
!type examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [86]:
data = pd.read_json('examples/example.json')

In [87]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [88]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [89]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [90]:
!pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in c:\users\danan\anaconda3\lib\site-packages (4.8.0)
Requirement already satisfied: html5lib in c:\users\danan\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: soupsieve>=1.2 in c:\users\danan\anaconda3\lib\site-packages (from beautifulsoup4) (1.9.3)
Requirement already satisfied: six>=1.9 in c:\users\danan\anaconda3\lib\site-packages (from html5lib) (1.12.0)
Requirement already satisfied: webencodings in c:\users\danan\anaconda3\lib\site-packages (from html5lib) (0.5.1)

WARNING: You are using pip version 19.3.1; however, version 20.0.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [92]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\danan\anaconda3\lib\site-packages (4.4.1)

WARNING: You are using pip version 19.3.1; however, version 20.0.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [94]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [95]:
len(tables)

1

In [96]:
failures = tables[0]

In [97]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [98]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [99]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [101]:
from lxml import objectify

In [103]:
path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [104]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
              'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [105]:
perf = pd.DataFrame(data)

In [106]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [112]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [113]:
root

In [114]:
root.get('href')

'http://www.google.com'

In [115]:
root.text

'Google'

### 6.2 이진 데이터 형식

In [116]:
frame = pd.read_csv('examples/ex1.csv')

frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [117]:
frame.to_pickle('examples/frame_pickle')

In [118]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [119]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [121]:
store = pd.HDFStore('mydata.h5')

In [122]:
store['obj1'] = frame

In [123]:
store['obj1_col'] = frame['a']

In [124]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [125]:
store['obj1']

           a
0   0.996811
1  -0.811565
2   0.306096
3   0.764821
4  -0.987367
..       ...
95 -2.170797
96  1.051044
97 -0.087638
98  0.719750
99  0.464176

[100 rows x 1 columns]

In [126]:
store.put('obj2', frame, format='table')

In [127]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.506236
11  0.494539
12 -0.136794
13 -0.154899
14  0.099097
15  1.411025

In [128]:
store.close()

In [129]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [130]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.996811
1 -0.811565
2  0.306096
3  0.764821
4 -0.987367

In [131]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [133]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [134]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [135]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [136]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [137]:
frame.to_excel(writer, 'Sheet1')

In [139]:
writer.save()

In [140]:
frame.to_excel('examples/ex2.xlsx')

### 6.3 웹 API와 함께 사용하기

In [141]:
import requests

In [142]:
url = 'http://api.github.com/repos/pandas-dev/pandas/issues'

In [143]:
resp = requests.get(url)

In [144]:
resp

In [145]:
data = resp.json()

In [146]:
data[0]['title']

'read_csv: if parse_dates dont appear in use_cols, we get a trace'

In [147]:
issues = pd.DataFrame(data, columns=['number','title',
                                    'labels','state'])

In [148]:
issues

,number,title,labels,state
0,31251,read_csv: if parse_dates dont appear in use_co...,[],open
1,31250,"pd.DataFrame.duplicated, drop_duplicates does ...",[],open
2,31249,TST: Fix timestamp comparison test,[],open
3,31248,REGR: CategoricalIndex and IntervalIndex are m...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
4,31247,ENH: Implement DataFrame.value_counts,[],open
...,...,...,...,...
25,31205,BUG: plotting regular tz-aware timeseries give...,"[{'id': 2413328, 'node_id': 'MDU6TGFiZWwyNDEzM...",open
26,31204,convert numeric column to dedicated `pd.String...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
27,31200,raise more explanatory error when failing init...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
28,31199,Writing HDF5 with StringDtype columns fails wi...,[],open
29,31198,DOC Remove Python 2 specific comments from doc...,[],open

### 6.4 데이터베이스와 함께 사용하기

In [149]:
import sqlite3

In [150]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER
);"""

In [151]:
con = sqlite3.connect('mydata.sqlite')

In [152]:
con.execute(query)

In [153]:
con.commit()

In [154]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento','Califonia', 1.7, 5)]

In [155]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [157]:
con.executemany(stmt, data)

In [158]:
con.commit()

In [159]:
cursor = con.execute('select * from test')

In [160]:
rows = cursor.fetchall()

In [161]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'Califonia', 1.7, 5)]

In [162]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [163]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

             a          b     c  d
0      Atlanta    Georgia  1.25  6
1  Tallahassee    Florida  2.60  3
2   Sacramento  Califonia  1.70  5

In [164]:
import sqlalchemy as sqla

In [166]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [167]:
pd.read_sql('select * from test', db)

             a          b     c  d
0      Atlanta    Georgia  1.25  6
1  Tallahassee    Florida  2.60  3
2   Sacramento  Califonia  1.70  5